Revit 2024 API
TextNode.BaseDirection Property
 Direction of the base line of the text object in model space.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public XYZ BaseDirection { get; }
Visual Basic
Public ReadOnly Property BaseDirection As XYZ
	Get
Visual C++
public:
property XYZ^ BaseDirection {
	XYZ^ get ();
}
See Also
TextNode Class
Autodesk.Revit.DB Namespace